Autodesk.Revit.DB.Electrical.AnalyticalBusData.TotalConnectedCurrent
The total connected current of the analytical bus.
Since:
2023

Autodesk.Revit.DB.Electrical.AnalyticalBusData.CurrentRating
The current rating value of the analytical bus.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for rating is not a number
-or-
When setting this property: The given value for rating is not finite
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for rating must be non-negative.
Since:
2023

Autodesk.Revit.DB.Electrical.AnalyticalBusData.Voltage
The voltage value of the analytical bus.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for voltage is not a number
-or-
When setting this property: The given value for voltage is not finite
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for voltage must be positive.
Since:
2023

Autodesk.Revit.DB.Electrical.AnalyticalBusData
Represents the data and parameters of analytical bus node.
Since:
2023